In [1]:
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt

# Problem definition 
## Analyse data to find any patterns between accidents
## Anlayse the frequency of accidents. 
#### - Does holidays lead to more accidents?
#### - Are bigger cities on the top of the list when it comes to number of accidents occured?
#### - What impact does the time of the day and weather condition have on the possibility if the accicdent to happen? 
#### - Does worse surface increase the likehood of accident? 
#### - What is the frequency of accident at each type of the listed intersections, what is the correlation between the lokehood of the accident to happen on particular intersection based on surface?
## Create Heatmap to find out regions of France where accidents are more likely to happen

# *Features*
### **CARACTERISTICS :**

Num_Acc : Accident ID

jour : Day of the accident

mois : Month of the accident

an : Year of the accident

hrmn : Time of the accident in hour and minutes (hhmm)

lum : Lighting : lighting conditions in which the accident occurred

1 - Full day

2 - Twilight or dawn

3 - Night without public lighting

4 - Night with public lighting not lit

5 - Night with public lighting on

dep : Departmeent : INSEE Code (National Institute of Statistics and Economic Studies) of the departmeent followed
by a 0 (201 Corse-du-Sud - 202 Haute-Corse)

com : Municipality: The commune number is a code given by INSEE. The code has 3 numbers set to the right.

Localisation :

1 - Out of agglomeration

2 - In built-up areas

int : Type of Intersection :

1 - Out of intersection

2 - Intersection in X

3 - Intersection in T

4 - Intersection in Y

5 - Intersection with more than 4 branches

6 - Giratory

7 - Place

8 - Level crossing

9 - Other intersection

atm : Atmospheric conditions:

1 - Normal

2 - Light rain

3 - Heavy rain

4 - Snow - hail

5 - Fog - smoke

6 - Strong wind - storm

7 - Dazzling weather

8 - Cloudy weather

9 - Other

col : Type of collision:

1 - Two vehicles - frontal

2 - Two vehicles - from the rear

3 - Two vehicles - by the side

4 - Three vehicles and more - in chain

5 - Three or more vehicles - multiple collisions

6 - Other collision

7 - Without collision

adr : Postal address: variable filled in for accidents occurring in built-up areas

gps : GPS coding: 1 originator character:

M = Métropole

A = Antilles (Martinique or Guadeloupe)

G = Guyane

R = Réunion

Y = Mayotte

Geographic coordinates in decimal degrees:

lat : Latitude

long : Longitude


### **Places:**

Num_Acc : Accident ID

catr : Category of road:

1 - Highway

2 - National Road

3 - Departmental Road

4 - Communal Way

5 - Off public network

6 - Parking lot open to public traffic

9 - other

voie : Road Number

V1: Numeric index of the route number (example: 2 bis, 3 ter etc.)

V2: Letter alphanumeric index of the road

circ: Traffic regime:

1 - One way

2 - Bidirectional

3 - Separated carriageways

4 - With variable assignment channels

nbv: Total number of traffic lanes

vosp: Indicates the existence of a reserved lane, regardless of whether or not the accident occurs on that lane.

1 - Bike path

2 - Cycle Bank

3 - Reserved channel

Prof: Longitudinal profile describes the gradient of the road at the accident site

1 - Dish

2 - Slope

3 - Hilltop

4- Hill bottom

pr: Home PR number (upstream terminal number)

pr1: Distance in meters to the PR (relative to the upstream terminal)

plan: Drawing in plan:

1 - Straight part

2 - Curved on the left

3 - Curved right

4 - In "S"

lartpc: Central solid land width (TPC) if there is

larrout: Width of the roadway assigned to vehicle traffic are not included the emergency stop strips,
CPRs and parking spaces

surf: surface condition

1 - normal

2 - wet

3 - puddles

4 - flooded

5 - snow

6 - mud

7 - icy

8 - fat - oil

9 - other

infra: Development - Infrastructure:

1 - Underground - tunnel

2 - Bridge - autopont

3 - Exchanger or connection brace

4 - Railway

5 - Carrefour arranged

6 - Pedestrian area

7 - Toll zone

situ: Situation of the accident:

1 - On the road

2 - On emergency stop band

3 - On the verge

4 - On the sidewalk

5 - On bike path

env1: school point: near a school

### **USERS:**

Acc_number: Accident identifier.

Num_Veh: Identification of the vehicle taken back for each user occupying this vehicle (including pedestrians who are
attached to the vehicles that hit them)

place: Allows to locate the place occupied in the vehicle by the user at the time of the accident

catu: User category:

1 - Driver

2 - Passenger

3 - Pedestrian

4 - Pedestrian in rollerblade or scooter

grav: Severity of the accident: The injured users are classified into three categories of victims plus the uninjured

1 - Unscathed

2 - Killed

3 - Hospitalized wounded

4 - Light injury

sex: Sex of the user

1 - Male

2 - Female

Year_on: Year of birth of the user

trip: Reason for traveling at the time of the accident:

1 - Home - work

2 - Home - school

3 - Shopping - Shopping

4 - Professional use

5 - Promenade - leisure

9 - Other

secu: on 2 characters:
the first concerns the existence of a safety equipment

1 - Belt

2 - Helmet

3 - Children's device

4 - Reflective equipment

9 - Other

the second is the use of Safety Equipment

1 - Yes

2 - No

3 - Not determinable

locp: Location of the pedestrian:

On pavement:

1 - A + 50 m from the pedestrian crossing

2 - A - 50 m from the pedestrian crossing

On pedestrian crossing:

3 - Without light signaling

4 - With light signaling

Various:

5 - On the sidewalk

6 - On the verge

7 - On refuge or BAU

8 - On against aisle

actp: Action of the pedestrian:

Moving

0 - not specified or not applicable

1 - Meaning bumping vehicle

2 - Opposite direction of the vehicle
Various

3 - Crossing

4 - Masked

5 - Playing - running

6 - With animal

9 - Other

etatp: This variable is used to specify whether the injured pedestrian was alone or not

1 - Only

2 - Accompanied

3 - In a group

### **VEHICLES:**

Num_Acc
Accident ID

Num_Veh
Identification of the vehicle taken back for each user occupying this vehicle (including pedestrians who are
attached to vehicles that hit them) - alphanumeric code

GP
Flow direction :

1 - PK or PR or increasing postal address number

2 - PK or PR or descending postal address number

CATV
Category of vehicle:

01 - Bicycle

02 - Moped <50cm3

03 - Cart (Quadricycle with bodied motor) (formerly "cart or motor tricycle")

04 - Not used since 2006 (registered scooter)

05 - Not used since 2006 (motorcycle)

06 - Not used since 2006 (side-car)

07 - VL only

08 - Not used category (VL + caravan)

09 - Not used category (VL + trailer)

10 - VU only 1,5T <= GVW <= 3,5T with or without trailer (formerly VU only 1,5T <= GVW <= 3,5T)

11 - Most used since 2006 (VU (10) + caravan)

12 - Most used since 2006 (VU (10) + trailer)

13 - PL only 3,5T

   # **Loading datasets**

In [2]:

path_caracteristics = "D:/Development/Porfolio/Data-Science/FranceAccidentsData/caracteristics.csv"
path_holidays = "D:/Development/Porfolio/Data-Science/FranceAccidentsData/holidays.csv"
path_places ="D:/Development/Porfolio/Data-Science/FranceAccidentsData/places.csv"
path_users ="D:/Development/Porfolio/Data-Science/FranceAccidentsData/users.csv"
path_vehicles ="D:/Development/Porfolio/Data-Science/FranceAccidentsData/vehicles.csv"

In [3]:
# Loading data files to seperate data framse 
df_caracteristics = pd.read_csv(path_caracteristics)
df_holidays = pd.read_csv(path_holidays)
df_places = pd.read_csv(path_places)
df_users = pd.read_csv(path_users)
df_vehicles = pd.read_csv(path_vehicles)

D:\Development\Anaconda\envs\DataAnalysis\lib\site-packages\IPython\core\interactiveshell.py:3169: DtypeWarning: Columns (14) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
D:\Development\Anaconda\envs\DataAnalysis\lib\site-packages\IPython\core\interactiveshell.py:3169: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [4]:
# Shpwing top 5 rows of caracteristics dataframe
df_caracteristics.head()

,Num_Acc,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
0,201600000001,16,2,1,1445,1,2,1,8.0,3.0,5.0,"46, rue Sonneville",M,0.0,0.0,590
1,201600000002,16,3,16,1800,1,2,6,1.0,6.0,5.0,1a rue du cimeti�re,M,0.0,0.0,590
2,201600000003,16,7,13,1900,1,1,1,1.0,6.0,11.0,NaN,M,0.0,0.0,590
3,201600000004,16,8,15,1930,2,2,1,7.0,3.0,477.0,52 rue victor hugo,M,0.0,0.0,590
4,201600000005,16,12,23,1100,1,2,3,1.0,3.0,11.0,rue Joliot curie,M,0.0,0.0,590

In [5]:
# Shpwing top 5 rows of holidays dataframe
df_holidays.head()

           ds                holiday
0  2005-01-01               New year
1  2005-03-28          Easter Monday
2  2005-05-01             Labour Day
3  2005-05-05     Ascension Thursday
4  2005-05-08  Victory in Europe Day

In [6]:
# Shpwing top 5 rows of places dataframe
df_places.head()

,Num_Acc,catr,voie,v1,v2,circ,nbv,pr,pr1,vosp,prof,plan,lartpc,larrout,surf,infra,situ,env1
0,201600000001,3.0,39,NaN,NaN,2.0,0.0,NaN,NaN,0.0,1.0,3.0,0.0,0.0,1.0,0.0,1.0,0.0
1,201600000002,3.0,39,NaN,NaN,1.0,0.0,NaN,NaN,0.0,1.0,2.0,0.0,58.0,1.0,0.0,1.0,0.0
2,201600000003,3.0,1,NaN,NaN,2.0,2.0,NaN,NaN,0.0,1.0,3.0,0.0,68.0,2.0,0.0,3.0,99.0
3,201600000004,4.0,0,NaN,NaN,2.0,0.0,NaN,NaN,0.0,1.0,1.0,0.0,0.0,1.0,0.0,1.0,99.0
4,201600000005,4.0,0,NaN,NaN,0.0,0.0,NaN,NaN,0.0,0.0,1.0,0.0,0.0,1.0,0.0,1.0,3.0

In [7]:
# Showing top 5 rows of users dataframe
df_users.head()

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh
0,201600000001,1.0,1,1,2,0.0,11.0,0.0,0.0,0.0,1983.0,B02
1,201600000001,1.0,1,3,1,9.0,21.0,0.0,0.0,0.0,2001.0,A01
2,201600000002,1.0,1,3,1,5.0,11.0,0.0,0.0,0.0,1960.0,A01
3,201600000002,2.0,2,3,1,0.0,11.0,0.0,0.0,0.0,2000.0,A01
4,201600000002,3.0,2,3,2,0.0,11.0,0.0,0.0,0.0,1962.0,A01

In [8]:
# Top 5 rows of vehicles dataframe 
df_vehicles.head()

        Num_Acc  senc  catv  occutc  obs  obsm  choc  manv num_veh
0  201600000001   0.0     7       0  0.0   0.0   1.0   1.0     B02
1  201600000001   0.0     2       0  0.0   0.0   7.0  15.0     A01
2  201600000002   0.0     7       0  6.0   0.0   1.0   1.0     A01
3  201600000003   0.0     7       0  0.0   1.0   6.0   1.0     A01
4  201600000004   0.0    32       0  0.0   0.0   1.0   1.0     B02

 # **Data Explolarion and data cleaning (deleting missing data entries from each dataframe)**

In [9]:
df_caracteristics.info

<bound method DataFrame.info of              Num_Acc  an  mois  jour  hrmn  lum  agg  int  atm  col    com  \
0       201600000001  16     2     1  1445    1    2    1  8.0  3.0    5.0
1       201600000002  16     3    16  1800    1    2    6  1.0  6.0    5.0
2       201600000003  16     7    13  1900    1    1    1  1.0  6.0   11.0
3       201600000004  16     8    15  1930    2    2    1  7.0  3.0  477.0
4       201600000005  16    12    23  1100    1    2    3  1.0  3.0   11.0
...              ...  ..   ...   ...   ...  ...  ...  ...  ...  ...    ...
839980  200500087950   5    12    21  2035    5    2    2  1.0  3.0  416.0
839981  200500087951   5    12    23  1010    1    2    1  1.0  3.0  416.0
839982  200500087952   5    12    26  1715    1    2    2  1.0  3.0  416.0
839983  200500087953   5    12    27  1500    1    2    3  2.0  5.0  416.0
839984  200500087954   5    12    31  2100    5    2    1  2.0  7.0  414.0

                             adr  gps  lat long  dep
0             46, rue Sonneville    M  0.0  0.0  590
1            1a rue du cimeti�re    M  0.0  0.0  590
2                            NaN    M  0.0  0.0  590
3             52 rue victor hugo    M  0.0  0.0  590
4               rue Joliot curie    M  0.0  0.0  590
...                          ...  ...  ...  ...  ...
839980   sans, LEBLOND(RUE M. ET  NaN  NaN  NaN  974
839981  SANS, PRESIDENT MITTERAN  NaN  NaN  NaN  974
839982   SANS, LEBLOND(RUE M. ET  NaN  NaN  NaN  974
839983  SANS, HUBERT DE LISLE(BO  NaN  NaN  NaN  974
839984                      RN01  NaN  NaN  NaN  974

[839985 rows x 16 columns]>

In [10]:
df_caracteristics.gps.isnull().count()

839985

In [11]:
df_caracteristics.tail()

,Num_Acc,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
839980,200500087950,5,12,21,2035,5,2,2,1.0,3.0,416.0,"sans, LEBLOND(RUE M. ET",NaN,NaN,NaN,974
839981,200500087951,5,12,23,1010,1,2,1,1.0,3.0,416.0,"SANS, PRESIDENT MITTERAN",NaN,NaN,NaN,974
839982,200500087952,5,12,26,1715,1,2,2,1.0,3.0,416.0,"SANS, LEBLOND(RUE M. ET",NaN,NaN,NaN,974
839983,200500087953,5,12,27,1500,1,2,3,2.0,5.0,416.0,"SANS, HUBERT DE LISLE(BO",NaN,NaN,NaN,974
839984,200500087954,5,12,31,2100,5,2,1,2.0,7.0,414.0,RN01,NaN,NaN,NaN,974

In [12]:
df_holidays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ds       132 non-null    object
 1   holiday  132 non-null    object
dtypes: object(2)
memory usage: 2.2+ KB

### Spliting holidays dates into day, year, month to match the caracteristics dataframe

In [13]:
df_holidays['day'] = df_holidays['ds'].str.split('-').str[2]
df_holidays['month'] = df_holidays['ds'].str.split('-').str[1]
df_holidays['year'] = df_holidays['ds'].str.split('-').str[0]

# Dropping "ds" column because it is no longer needed, dataframe now matches other dataframes in how date is structured
df_holidays.drop("ds", axis = 'columns', inplace=True)

In [14]:
df_holidays.head()

                 holiday day month  year
0               New year  01    01  2005
1          Easter Monday  28    03  2005
2             Labour Day  01    05  2005
3     Ascension Thursday  05    05  2005
4  Victory in Europe Day  08    05  2005

In [15]:
df_holidays['day'] = df_holidays['day'].astype(str).astype(int) 
df_holidays['month'] = df_holidays['month'].astype(str).astype(int) 
df_holidays['year'] = df_holidays['year'].astype(str).astype(int) 
df_holidays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   holiday  132 non-null    object
 1   day      132 non-null    int32
 2   month    132 non-null    int32
 3   year     132 non-null    int32
dtypes: int32(3), object(1)
memory usage: 2.7+ KB

In [16]:
df_caracteristics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 839985 entries, 0 to 839984
Data columns (total 16 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  839985 non-null  int64
 1   an       839985 non-null  int64
 2   mois     839985 non-null  int64
 3   jour     839985 non-null  int64
 4   hrmn     839985 non-null  int64
 5   lum      839985 non-null  int64
 6   agg      839985 non-null  int64
 7   int      839985 non-null  int64
 8   atm      839930 non-null  float64
 9   col      839974 non-null  float64
 10  com      839983 non-null  float64
 11  adr      699443 non-null  object
 12  gps      366226 non-null  object
 13  lat      362471 non-null  float64
 14  long     362467 non-null  object
 15  dep      839985 non-null  int64
dtypes: float64(4), int64(9), object(3)
memory usage: 102.5+ MB

In [17]:
# Renaming column names for dates to match holidays date names
df_caracteristics.rename(columns={"mois" : "month",
                                  "an": "year",
                                  "jour": "day"}, inplace=True)    
df_caracteristics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 839985 entries, 0 to 839984
Data columns (total 16 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  839985 non-null  int64
 1   year     839985 non-null  int64
 2   month    839985 non-null  int64
 3   day      839985 non-null  int64
 4   hrmn     839985 non-null  int64
 5   lum      839985 non-null  int64
 6   agg      839985 non-null  int64
 7   int      839985 non-null  int64
 8   atm      839930 non-null  float64
 9   col      839974 non-null  float64
 10  com      839983 non-null  float64
 11  adr      699443 non-null  object
 12  gps      366226 non-null  object
 13  lat      362471 non-null  float64
 14  long     362467 non-null  object
 15  dep      839985 non-null  int64
dtypes: float64(4), int64(9), object(3)
memory usage: 102.5+ MB

In [18]:
df_holidays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   holiday  132 non-null    object
 1   day      132 non-null    int32
 2   month    132 non-null    int32
 3   year     132 non-null    int32
dtypes: int32(3), object(1)
memory usage: 2.7+ KB

In [19]:
df_caracteristics["year"].astype('int32')

0         16
1         16
2         16
3         16
4         16
          ..
839980     5
839981     5
839982     5
839983     5
839984     5
Name: year, Length: 839985, dtype: int32

In [20]:
df_caracteristics.count()

Num_Acc    839985
year       839985
month      839985
day        839985
hrmn       839985
lum        839985
agg        839985
int        839985
atm        839930
col        839974
com        839983
adr        699443
gps        366226
lat        362471
long       362467
dep        839985
dtype: int64

In [21]:
df_holidays.count()

holiday    132
day        132
month      132
year       132
dtype: int64

In [22]:
df_caracteristics.info()
df_holidays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 839985 entries, 0 to 839984
Data columns (total 16 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  839985 non-null  int64
 1   year     839985 non-null  int64
 2   month    839985 non-null  int64
 3   day      839985 non-null  int64
 4   hrmn     839985 non-null  int64
 5   lum      839985 non-null  int64
 6   agg      839985 non-null  int64
 7   int      839985 non-null  int64
 8   atm      839930 non-null  float64
 9   col      839974 non-null  float64
 10  com      839983 non-null  float64
 11  adr      699443 non-null  object
 12  gps      366226 non-null  object
 13  lat      362471 non-null  float64
 14  long     362467 non-null  object
 15  dep      839985 non-null  int64
dtypes: float64(4), int64(9), object(3)
memory usage: 102.5+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   holiday  132 non-null    object
 1   day      132 non-null    int32
 2   month    132 non-null    int32
 3   year     132 non-null    int32
dtypes: int32(3), object(1)
memory usage: 2.7+ KB

In [23]:
df_holidays

                          holiday  day  month  year
0                        New year    1      1  2005
1                   Easter Monday   28      3  2005
2                      Labour Day    1      5  2005
3              Ascension Thursday    5      5  2005
4           Victory in Europe Day    8      5  2005
..                            ...  ...    ...   ...
127                  Bastille Day   14      7  2016
128  Assumption of Mary to Heaven   15      8  2016
129                All Saints Day    1     11  2016
130                 Armistice Day   11     11  2016
131                 Christmas Day   25     12  2016

[132 rows x 4 columns]

In [63]:
df_holidays_2005 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2006, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2006, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2006, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2006, 'year']})
df_holidays_2006 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2006, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2006, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2006, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2006, 'year']})
df_holidays_2007 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2007, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2007, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2007, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2007, 'year']})
df_holidays_2008 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2008, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2008, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2008, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2008, 'year']})
df_holidays_2009 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2009, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2009, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2009, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2009, 'year']})
df_holidays_2010 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2010, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2010, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2010, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2010, 'year']})
df_holidays_2011 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2011, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2011, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2011, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2011, 'year']})
df_holidays_2012 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2012, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2012, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2012, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2012, 'year']})
df_holidays_2013 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2013, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2013, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2013, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2013, 'year']})
df_holidays_2014 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2014, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2014, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2014, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2014, 'year']})
df_holidays_2015 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2015, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2015, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2015, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2015, 'year']})
df_holidays_2016 = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == 2016, 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == 2016, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == 2016, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == 2016, 'year']})
df_holidays_2014

                     Holiday_Name  Month  Day  Year
99                       New year      1    1  2014
100                 Easter Monday      4   21  2014
101                    Labour Day      5    1  2014
102         Victory in Europe Day      5    8  2014
103            Ascension Thursday      5   29  2014
104                   Whit Monday      6    9  2014
105                  Bastille Day      7   14  2014
106  Assumption of Mary to Heaven      8   15  2014
107                All Saints Day     11    1  2014
108                 Armistice Day     11   11  2014
109                 Christmas Day     12   25  2014

In [64]:
df_holidays_2013

                    Holiday_Name  Month  Day  Year
88                      New year      1    1  2013
89                 Easter Monday      4    1  2013
90                    Labour Day      5    1  2013
91         Victory in Europe Day      5    8  2013
92            Ascension Thursday      5    9  2013
93                   Whit Monday      5   20  2013
94                  Bastille Day      7   14  2013
95  Assumption of Mary to Heaven      8   15  2013
96                All Saints Day     11    1  2013
97                 Armistice Day     11   11  2013
98                 Christmas Day     12   25  2013

0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
         ...
839980    nan
839981    nan
839982    nan
839983    nan
839984    nan
Name: long, Length: 839985, dtype: string

In [169]:
df_hol.head()

        Num_Acc        Holiday_Name
0  201500000044  Ascension Thursday
1  201500000095      All Saints Day
2  201500000118       Easter Monday
3  201500000135            New year
4  201500000161        Bastille Day

In [25]:
def fill(year):
    df_holidays_ = pd.DataFrame({"Holiday_Name": df_holidays.loc[df_holidays['year'] == year , 'holiday'],
                                 "Month": df_holidays.loc[df_holidays["year"] == year, 'month'],
                                 "Day": df_holidays.loc[df_holidays["year"] == year, 'day'],
                                 "Year": df_holidays.loc[df_holidays["year"] == year, 'year']})
    return df_holidays_

In [26]:
fill(2006)

                    Holiday_Name  Month  Day  Year
11                      New year      1    1  2006
12                 Easter Monday      4   17  2006
13                    Labour Day      5    1  2006
14         Victory in Europe Day      5    8  2006
15            Ascension Thursday      5   25  2006
16                   Whit Monday      6    5  2006
17                  Bastille Day      7   14  2006
18  Assumption of Mary to Heaven      8   15  2006
19                All Saints Day     11    1  2006
20                 Armistice Day     11   11  2006
21                 Christmas Day     12   25  2006

In [27]:
df_caracteristics.head()

,Num_Acc,year,month,day,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
0,201600000001,16,2,1,1445,1,2,1,8.0,3.0,5.0,"46, rue Sonneville",M,0.0,0.0,590
1,201600000002,16,3,16,1800,1,2,6,1.0,6.0,5.0,1a rue du cimeti�re,M,0.0,0.0,590
2,201600000003,16,7,13,1900,1,1,1,1.0,6.0,11.0,NaN,M,0.0,0.0,590
3,201600000004,16,8,15,1930,2,2,1,7.0,3.0,477.0,52 rue victor hugo,M,0.0,0.0,590
4,201600000005,16,12,23,1100,1,2,3,1.0,3.0,11.0,rue Joliot curie,M,0.0,0.0,590

In [28]:
fill(2006).iloc[0]["Holiday_Name"]

'New year'

In [29]:
df_caracteristics_ = df_caracteristics.loc[df_caracteristics["day"] == fill(2006).iloc[0]["Day"]]
df_caracteristics_
df_caracteristics_1 = df_caracteristics_.loc[df_caracteristics["month"] == fill(2006).iloc[0]["Month"]]
df_caracteristics_1
df_caracteristics_2 = df_caracteristics_1.loc[df_caracteristics["year"] == fill(2006).iloc[0]["Year"]]
df_caracteristics_2

Empty DataFrame
Columns: [Num_Acc, year, month, day, hrmn, lum, agg, int, atm, col, com, adr, gps, lat, long, dep]
Index: []

In [30]:
df_caracteristics.loc[df_caracteristics['year'] == 6, 'year'] = 2006
df_caracteristics.loc[df_caracteristics['year'] == 5, 'year'] = 2005
df_caracteristics.loc[df_caracteristics['year'] == 7, 'year'] = 2007
df_caracteristics.loc[df_caracteristics['year'] == 8, 'year'] = 2008
df_caracteristics.loc[df_caracteristics['year'] == 9, 'year'] = 2009
df_caracteristics.loc[df_caracteristics['year'] == 10, 'year'] = 2010
df_caracteristics.loc[df_caracteristics['year'] == 11, 'year'] = 2011
df_caracteristics.loc[df_caracteristics['year'] == 12, 'year'] = 2012
df_caracteristics.loc[df_caracteristics['year'] == 13, 'year'] = 2013
df_caracteristics.loc[df_caracteristics['year'] == 14, 'year'] = 2014
df_caracteristics.loc[df_caracteristics['year'] == 15, 'year'] = 2015
df_caracteristics.loc[df_caracteristics['year'] == 16, 'year'] = 2016

In [31]:
df_caracteristics["Num_Acc"]

0         201600000001
1         201600000002
2         201600000003
3         201600000004
4         201600000005
              ...
839980    200500087950
839981    200500087951
839982    200500087952
839983    200500087953
839984    200500087954
Name: Num_Acc, Length: 839985, dtype: int64

In [35]:
df_holidays_2005.head()

            Holiday_Name  Month  Day  Year
0               New year      1    1  2005
1          Easter Monday      3   28  2005
2             Labour Day      5    1  2005
3     Ascension Thursday      5    5  2005
4  Victory in Europe Day      5    8  2005

In [ ]:
df_accidents_hol_2015 = []
for row in df_caracteristics.itertuples(name = "Holidays"):
    for row2 in df_holidays_2015.itertuples():
        if row.Day == row2.Day and row.Month == row2.Month and row.Year == row2.Year:
            dict = {"Num_Acc": row.Num_Acc,
                    "Holiday_Name": row2.Holiday_Name}
            df_accidents_hol_2015.append(dict)
df_hol = pd.DataFrame(df_accidents_hol_2015)